Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དག་རྣམ་པར་དག་པའི་ལམ་གང་ལ་ཞུགས་ན་ཤིན་ཏུ་མཐར་ཐུག་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བ་དང་། སྟོབས་བཅུའི་སྟོབས་ཉིད་དང་། མི་འཇིགས་པ་བཞིའི་འཇིགས་པ་མེད་པ་ཉིད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་གྱི་བར་དུ་བར་སྐབས་སུ་ཞུམ་པ་དང་གང་བར་མི་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་ལམ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཞེས་བགྱི་བ་དེ་བཞིན་གཤེགས་པས་བཤད་དུ་གསོལ།
en: Blessed One, please explain the pure path of bodhisattvas, known as the domain of the bodhisattvas, by which bodhisattvas who enter the pure path will reach the ultimate and will, throughout the intervening period, be neither discouraged nor satisfied until they perfect the ten powers, the four types of fearlessness, and all the qualities of a buddha!

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Thus-Gone One, please explain it.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་ལམ་ནི་བརྒྱད་པོ་འདི་དག་སྟེ།
en: “Lord of nāgas,” the Blessed One replied to the nāga king Anavatapta, “the pure path of bodhisattvas is eightfold.

source: བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་དང་། བསྡུ་བའི་དངོས་པོའི་ལམ་དང་།
en: What are the eight parts?

source: མངོན་པར་ཤེས་པའི་ལམ་དང་། ཚད་མེད་པའི་ལམ་དང་། ཡན་ལག་བརྒྱད་པའི་ལམ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའི་ལམ་དང་། རྣམ་པར་ཐར་པ་གསུམ་གྱི་ལམ་དང་།
en: They are the path of the perfections, the path of the means of attraction, the path of the higher perceptions, the path of the immeasurable attitudes, the eightfold path, the path of impartiality toward all beings, the path of the three gateways to liberation, and the path of reaching acceptance of the unborn nature of phenomena.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་ལམ་སྟེ། ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་ལམ་ནི་བརྒྱད་པོ་དེ་དག་གོ། །
en: Lord of nāgas, these are the eight.

source: དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པའོ། །
en: “The path of the perfections consists in complete dedication toward omniscience.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྔོས་པའི་སྦྱིན་པ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་མི་འཐོབ་བོ། །
en: Because generosity that is not dedicated toward omniscience cannot be considered as the perfection of generosity.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་།
en: It is the same with discipline, patience, diligence, concentration, and insight.

source: ཤེས་རབ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་མ་བསྔོས་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་མི་འཐོབ་སྟེ།
en: Insight that is not dedicated toward omniscience cannot be considered as the perfection of insight.

source: དེའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ཞེས་བྱའོ། །
en: Dedication toward omniscience is thus known as the path of the perfections.

source: དེ་ལ་བསྡུ་བའི་དངོས་པོའི་ལམ་ནི་གཞན་དག་ཆོས་ལ་མོས་པར་བྱེད་པའོ། །
en: “The path of the means of attraction consists in inspiring devotion toward the Dharma in others.

source: ཀླུའི་བདག་པོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་ཅན་གང་དག་བསྡུ་བའི་དངོས་པོ་བཞི་པོ་དག་གིས་བསྡུས་པར་གྱུར་པ་དེ་དག་དེས་ཆོས་བསྟན་པ་ཀུན་ཏུ་ཤེས་པར་འགྱུར་ཏེ།
en: Lord of nāgas, those beings who have been attracted by bodhisattvas through the four means of attraction will understand the Dharma teachings.

source: དེའི་ཕྱིར་གཞན་དག་ཆོས་ལ་མོས་པར་བྱེད་པ་ནི་བསྡུ་བའི་དངོས་པོའི་ལམ་ཞེས་བྱའོ། །
en: So, inducing devotion toward the Dharma in others is known as the path of the means of attraction.

source: དེ་ལ་མངོན་པར་ཤེས་པའི་ལམ་ནི་གང་ལྷའི་མིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་མཐོང་། སེམས་ཅན་ཤི་འཕོ་དང་སྐྱེ་བ་ཡང་མཐོང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཡང་མཐོང་ངོ་། །
en: “The path of the higher perceptions consists in seeing with the divine eye all the buddha fields, the death, transference, and rebirth of beings, and the blessed buddhas along with their saṅghas of hearers.

source: དེ་དག་མཐོང་ནས་ཀྱང་རྣམ་པ་གང་དག་ཡོངས་སུ་གཟུང་བར་བྱ་བ་དེ་དག་ནི་ཡོངས་སུ་འཛིན། གང་དག་ཡོངས་སུ་སྤང་བར་བྱ་བ་དེ་དག་ནི་ཡོངས་སུ་སྤང་ངོ་། །
en: Once these are seen, what should be taken up is taken up, and what should be cast aside is cast aside.

source: གང་ལྷའི་རྣ་བས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་གསུངས་པ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་འཛིན་ཅིང་ཆུད་མི་གསོན་ཏོ། །
en: It consists in hearing with the divine ear the words of the blessed buddhas and, having heard those words, remembering them and not squandering them.

source: དེ་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་སེམས་ཀྱི་རྒྱུ་བ་ཡང་རབ་ཏུ་ཤེས་ཏེ། ཤེས་ནས་ཀྱང་སོ་སོར་ཅི་རིགས་པར་ཆོས་སྟོན་ཏོ། །
en: It consists in knowing clearly the mental processes of other beings and other individuals and teaching the Dharma accordingly to each.

source: དེ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་ཏེ། དྲན་ནས་ཀྱང་སྔོན་བྱས་པའི་དགེ་བའི་རྩ་བ་ཆུད་མི་གཟོན་ཏོ། །
en: It consists in remembering one’s past births and not squandering the roots of virtue acquired through previous actions.

source: རྫུ་འཕྲུལ་གྱིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པ་དག་ཏུ་འགྲོ་ཞིང་སེམས་ཅན་གང་དག་རྫུ་འཕྲུལ་གྱིས་འདུལ་བ་དག་ཀྱང་རྫུ་འཕྲུལ་གྱིས་འདུལ་ཏེ།
en: It consists in manifesting miraculous powers to travel to limitless buddha fields and using miraculous powers to tame those beings who must be tamed.

source: དེའི་ཕྱིར་མངོན་པར་ཤེས་པའི་ལམ་ཞེས་བྱའོ། །
en: Thus it is known as the path of the higher perceptions.

source: དེ་ལ་ཚད་མེད་པའི་ལམ་ནི་གང་སྡུག་པའི་རྣམ་པར་ལྟུང་བའི་ཚངས་པ་རྣམས་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷ་གཞན་དག་གི་སེམས་ཀྱི་འཇུག་པ་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: “The path of the immeasurable attitudes consists in understanding the mindset of the brahmās of good aspect and the other gods of the form realm.

source: འདི་ནི་བྱམས་པའི་སེམས། འདི་ནི་སྙིང་རྗེ་ཆེན་པོའི་སེམས། འདི་ནི་དགའ་བའི་སེམས།
en: These are said to be the attitude of love, the attitude of great compassion, the attitude of joy, and the attitude of equanimity.

source: འདི་ནི་བཏང་སྙོམས་ཀྱི་སེམས་སོ་ཞེས་ཇི་ལྟ་བུས་འདུལ་བ་དེ་བཞིན་དུ་རབ་ཏུ་འདྲེན་ཏེ།
en: One is to be guided by such a training.

source: དེ་ཕྱིར་ཚད་མེད་པའི་ལམ་ཞེས་བྱའོ། །
en: Thus it is known as the path of the immeasurable attitudes.

source: དེ་ལ་ཡན་ལག་བརྒྱད་པའི་ལམ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པའི་རྗེས་སུ་སོང་བ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་རྗེས་སུ་སོང་བ་དང་། ཐེག་པ་ཆེན་པོའི་རྗེས་སུ་སོང་བ་སྟེ།
en: “The eightfold path can be followed by all—it can be followed by those on the vehicle of the hearers, those on the vehicle of the solitary buddhas, and those on the Great Vehicle.

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བས་དེའི་ཕྱིར་ཡན་ལག་བརྒྱད་པའི་ལམ་ཞེས་བྱའོ། །
en: It can be followed by everyone, and thus it is known as the eightfold path.

source: དེ་ལ་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའི་ལམ་ནི་འདིའི་ནི་བྱའོ། །འདིའི་ནི་མི་བྱའོ། །འདི་ལ་ནི་བཤད་དོ། །འདི་ལ་ནི་མི་བཤད་དོ། །འདི་ནི་སྦྱིན་གནས་སོ། །
en: “The path of impartiality toward all beings consists in refraining from discrimination such as ‘I will do it for this one but not for that one,’ ‘I will explain for this person but not for that one,’ or ‘This person is worthy of my generosity, but that one is not.’

source: འདི་ནི་སྦྱིན་གནས་མ་ཡིན་ནོ་ཞེས་དེ་རྣམ་པར་རྟོག་པ་ལ་མི་སྤྱོད་དེ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་འགྲོ་བས་དེའི་ཕྱིར་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའི་ལམ་ཞེས་བྱའོ། །
en: Instead, it takes the route of impartiality toward all beings, and thus it is known as the path of impartiality toward all beings.

source: དེ་ལ་རྣམ་པར་ཐར་པ་གསུམ་གྱི་ལམ་ནི་དམིགས་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་སྟོང་པ་ཉིད་དང་། རྟོག་པ་དང་། རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པ་དང་། མཚན་མ་དང་། རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར་མཚན་མ་མེད་པ་དང་།
en: “The path of the three gateways to liberation refers to emptiness, in which all reference points are abandoned; signlessness, in which all thoughts, concepts, discursiveness, signs, and ideas are abandoned; and wishlessness, in which reliance on the three realms is abandoned.

source: ཁམས་གསུམ་པ་ལ་རྟོན་པ་སྤང་བའི་ཕྱིར་སྨོན་པ་མེད་པ་སྟེ། དེའི་ཕྱིར་རྣམ་པར་ཐར་པ་གསུམ་གྱི་ལམ་ཞེས་བྱའོ། །
en: Thus it is known as the path of the three gateways to liberation.

source: དེ་ལ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་ལམ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པ་རབ་ཏུ་ཐོབ་པ་ཡིན་ཏེ།
en: “The path of the attainment of acceptance of the unborn nature of phenomena refers to the bodhisattvas’ attainment of prophecy.

source: མི་སྐྱེ་བ་ལ་བཟོད་པ་དེ་དང་ལྡན་པར་རིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་ཏེ།
en: Knowing that bodhisattvas have reached acceptance of the unborn nature of phenomena, the blessed buddhas prophesy their unsurpassed and perfect awakening.

source: དེའི་ཕྱིར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་ལམ་ཞེས་བྱའོ། །
en: Thus it is known as the path of reaching the acceptance of the unborn nature of phenomena.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་ལམ་བརྒྱད་པོ་འདི་དག་ནི་གཅིག་པུ་བགྲོད་པའི་ལམ་དུ་ཡང་དག་པར་འདུ་བ་སྟེ།
en: “Lord of nāgas, these eight pure paths of bodhisattvas are combined in a single path to be traversed alone.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གྲོགས་མེད་པར་གཅིག་པུ་གཉིས་སུ་མེད་པར་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གང་ཐོབ་པར་བྱ་བ་དེ་རྗེས་སུ་འཐོབ་པའོ། །
en: Without companions, alone, and unassisted, bodhisattvas will reach that which must be reached—the seat of awakening—through their instantaneous insight.

source: དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ཅི་ཞེ་ན།
en: Why are thus-gone ones referred to as such?

source: གང་འདི་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་རྗེས་སུ་ཐོབ་པ་སྟེ།
en: Because they have reached the thusness of all phenomena.

source: དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ། །
en: That is why they are called thus-gone ones.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་དག་པའི་ལམ་བརྒྱད་པོ་འདི་དག་ནི་སེམས་ཅན་ཐ་དད་པ་དང་སྣ་ཚོགས་ལ་སྦྱོར་བ་རྣམས་ལ་བསྟན་པ་སྟེ།
en: Lord of nāgas, this teaching on the eightfold pure path of bodhisattvas is taught for a variety of beings who practice in different ways.

source: གང་འདི་མི་དམིགས་པ་ཉེ་བར་བཟུང་ནས་བསྟན་པ་དེ་ཐམས་ཅད་ནི་བསྟན་པ་གཅིག་པའོ། །
en: But when taught from the perspective of the absence of reference points, all are subsumed in a single teaching.

source: དེ་ལ་ལམ་དེའི་རྣམ་པར་དག་པ་གང་ཞེ་ན།
en: “What is meant by the purity of this path?

source: ལམ་འདི་ནི་རྡུལ་མེད་པས་རྡུལ་དང་བྲལ་བའོ། །
en: Since there is no dust on this path, it is spotless.

source: ལམ་འདི་ནི་ཤིན་ཏུ་མི་འཁྲུགས་པས་ཞེ་སྡང་མེད་པའོ། །
en: Since this path is undisturbed, it is devoid of aggression.

source: ལམ་འདི་ནི་ཤེས་རབ་ཀྱིས་སྣང་བས་རྨོངས་པ་མེད་པའོ། །
en: Since this path is illuminated by insight, it is devoid of confusion.

source: ལམ་འདི་ནི་རང་བཞིན་གྱིས་རྣམ་པར་དག་པས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པའོ། །
en: Since this path is pure by nature, it is devoid of any kind of affliction.

source: ལམ་འདི་ནི་ཕྱིན་ཅི་ལོག་བཞི་ལས་བྱུང་བའི་ཕྱིར་སྐྱེ་བ་མེད་པའོ། །
en: Since this path is emancipated from the four misconceptions, it is unborn.

source: ལམ་འདི་ནི་ངོ་བོ་ཉིད་ཀྱིས་ཡང་དག་པ་མ་ཡིན་པར་མཐོང་བས་ངོ་བོ་ཉིད་མེད་པའོ། །
en: Since this path is seen as unreal in essence, it lacks an essential nature.

source: ལམ་འདི་ནི་འདོད་པ་དང་། གཟུགས་དང་། གཟུགས་མེད་པ་རྣམ་པར་ཤེས་པས་ཟག་པ་མེད་པའོ། །
en: Since this path takes into account the desire, form, and formless realms, it is undefiled.

source: ལམ་འདི་ནི་དམིགས་པ་ཐ་དད་པ་དང་བྲལ་བས་ཉེ་བར་ཞི་བའོ། །
en: Since this path is without distinct reference points, it is peaceful.

source: ལམ་འདི་ནི་གར་ཡང་མི་འགྲོ་ཞིང་གང་ནས་ཀྱང་མི་འོང་བས་འོང་བ་དང་འགྲོ་བ་མེད་པའོ། །
en: Since this path neither goes to nor comes from anywhere, it is without coming and going.

source: ལམ་འདི་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་མི་གནས་པས་ལེགས་པར་གནས་པའོ། །
en: Since this path does not dwell on any affliction, it is well settled.

source: ལམ་འདི་ལ་ནི་བདུད་རྣམས་ཀྱིས་འགྲོ་བ་མེད་པའོ། །
en: On this path, māras do not tread.

source: ལམ་འདི་ནི་མུ་སྟེགས་ཅན་རྣམས་ཀྱིས་མ་ཡིན་ནོ། །
en: This path is not for non-Buddhists.

source: ལམ་འདི་ལ་ནི་མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་ཀྱི་སྐབས་མེད་དོ། །
en: On this path there is no opportunity for those with the pride of conceit.

source: ལམ་འདིར་ནི་མི་བརྩོན་པ་རྣམས་འཇུག་པ་མ་ཡིན་ནོ། །
en: This path is not embarked upon by those who do not have perseverance.

source: ལམ་འདི་ནི་དམིགས་པ་ཅན་རྣམས་དང་ཤིན་ཏུ་རིང་ཞིང་རྣམ་པར་རིང་ངོ་། །
en: This path is very long and tiring for those who hold on to reference points.

source: ལམ་འདི་ནི་སྐྱེས་བུ་ངན་པ་རྣམས་ཀྱིས་རྣམ་པར་སྤངས་པའོ། །
en: This path is forsaken by wrongdoers.

source: ལམ་འདི་ནི་སྐྱེས་བུ་དམ་པ་རྣམས་ཀྱིས་བསྟེན་པའོ། །
en: This path is relied upon by holy beings.

source: ལམ་འདི་ནི་རྣལ་འབྱོར་སྤྱོད་པ་རྣམས་རྗེས་སུ་འདོང་བའོ། །
en: This path is followed by those who engage in yogic practices.

source: ལམ་འདི་ནི་ཚུལ་བཞིན་ལ་བརྩོན་པ་རྣམས་ཀྱིས་བགྲོད་པར་བདེ་བའོ། །
en: This path is pleasant to travel upon for those who exert themselves in the right way.

source: ལམ་འདི་ནི་ཡང་དག་པར་ལྟ་བ་ལ་ཡང་དག་པར་གནས་པ་རྣམས་ཀྱི་རྣལ་དུ་འཇུག་པའོ། །
en: This path consists of resting naturally for those who are properly settled in the right view.

source: ལམ་འདི་ནི་བརྩོན་པ་རྣམས་ལ་མི་སྒྲིབ་པས་ཡངས་པའོ། །
en: This path is wide open for those who are diligent and without obscurations.

source: ལམ་འདི་ནི་ཡང་དག་པར་སོང་བ་དང་། ཡང་དག་པར་ཞུགས་པ་རྣམས་ལ་མི་སྒྲིབ་པའོ། །
en: This path is without obstruction for those who enter and follow it correctly.

source: ལམ་འདི་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཉོན་མོངས་པ་རྣམས་ཀྱི་དྲི་མ་མེད་པའོ། །
en: This path is untainted by the afflictions of desire, aversion, and delusion.

source: ལམ་འདི་ནི་ཤིན་ཏུ་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པས་རྣམ་པར་དག་པ་སྟེ།
en: This path is pure, since it is utterly devoid of affliction.

source: དེའི་ཕྱིར་རྣམ་པར་དག་པའི་ལམ་ཞེས་བྱའོ། །
en: That is why it is known as the pure path.

source: ཀླུའི་བདག་པོ་གང་ལ་ལ་དག་རྣམ་པར་དག་པའི་ལམ་འདི་ལ་ཞུགས་པ་དང་། འཇུག་པ་དང་། འཇུག་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པས་བདག་གི་དབྱིངས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །བདག་གི་དབྱིངས་རྣམ་པར་དག་པས་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །
en: “Lord of nāgas, all those who have entered, who are entering, and who will enter this pure path come to understand that since the realm of phenomena is pure, the realm of the self is pure; and since the realm of the self is pure, the realm of phenomena is pure.

source: ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་དག་པས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པར་དག་པས་མིག་གི་ཁམས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་པ་ནས་ཡིད་ཀྱི་ཁམས་ཀྱི་བར་དུ་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །ཡིད་ཀྱི་ཁམས་རྣམ་པར་དག་པས་འདོད་པ་དང་། གཟུགས་དང་།
en: They realize that since the realm of phenomena is pure, all the realms of beings are pure; and since all the realms of beings are pure, the eye element is pure—so they realize that all the sensory elements up to the element of the mental faculty are also pure.

source: གཟུགས་མེད་པའི་ཁམས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །འདོད་པ་དང་། གཟུགས་དང་། གཟུགས་མེད་པའི་ཁམས་རྣམ་པར་དག་པས་ནམ་མཁའི་ཁམས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་སོ། །ནམ་མཁའི་ཁམས་རྣམ་པར་དག་པས་ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་ཏེ།
en: And since the element of the mental faculty is pure, they realize that the desire, form, and formless realms are pure; and since the desire, form, and formless realms are pure, they realize that the element of space is pure; and since the element of space is pure, they realize that all phenomena are pure.

source: འདི་ལྟར་ནམ་མཁའ་རྣམ་པར་དག་པའི་རྣམ་པར་དག་པ་འདིས་ཆོས་ཐམས་ཅད་མཉམ་མོ། །
en: In this way, with this purity of pure space, all phenomena are equal.

source: དེ་ལྟར་ནམ་མཁའ་རྣམ་པར་དག་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་དག་པ་དང་། བདག་རྣམ་པར་དག་པ་འདི་ནི་གཉིས་སུ་མེད་དེ་གཉིས་སུ་དབྱེར་མེད་དོ། །
en: Therefore, the purity of space, the purity of all phenomena, and the purity of the self are inseparable—they cannot be divided.

source: གཉིས་སུ་མེད་པ་རྣམ་པར་དག་པ་འདིས་ལམ་དེ་རྣམ་པར་དག་སྟེ།
en: This path is pure in terms of this indivisible purity.

source: དེ་ལ་ཚོར་བ་མེད་པས་ལམ་དེ་ནི་ཚོར་བ་མེད་པ་སྟེ། ཚོར་བ་ཐམས་ཅད་ཀྱི་རྒྱུན་བཅད་པའོ། །
en: On it there is no sensation; it is the path of no sensation—all sensations cease.

source: དེ་ལ་ནི་མྱ་ངན་ལས་འདས་པའི་ཚོར་བ་ཡང་མེད་དེ།
en: On it there is not even the sensation of nirvāṇa.

source: དེའི་ཕྱིར་ཚོར་བ་མེད་པ་ཞེས་བྱའོ། །
en: So it is known as devoid of sensation.

source: ལམ་དེ་ནི་སེམས་དང་ཡིད་དང་རྣམ་པར་ཤེས་པ་དང་བྲལ་བས་དེ་ལ་ནི་ཆོས་ལ་སེམས་པ་ཅི་ཡང་མེད་དེ།
en: This path, since it is free of mind, mental faculty, and consciousness, is devoid of all mental projection toward phenomena.

source: བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པར་དག་པའི་ལམ་བསྒོམས་པའི་ཡོན་ཏན་གྱི་ལེའུ་འདི་བཤད་པ་ན་ཡོངས་སུ་སྦྱང་བ་བྱས་པའི་སྲོག་ཆགས་ཁྲི་ཉིས་སྟོང་གིས་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: When the Blessed One delivered this teaching on the good qualities of cultivating this pure path, twelve thousand beings who had purified themselves reached acceptance.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་འཕགས་པའི་ལམ་བསྒོམ་པར་བགྱི།
en: The nāga king Anavatapta then asked the Blessed One, “Blessed One, how should bodhisattvas cultivate the path of the noble ones?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་རྣམ་པར་དག་པའི་ལམ་བསྒོམ་པར་འདོད་པས་རྣམ་པར་དག་པའི་སྤྱོད་པ་ལ་མཁས་པར་བྱ་སྟེ། དེས་ལུས་ཡོངས་སུ་དག་པར་བྱ། ངག་དང་སེམས་ཡོངས་སུ་དག་པར་བྱའོ། །
en: The Blessed One replied, “Lord of nāgas, bodhisattvas who wish to cultivate the pure path of the noble ones should become expert in pure conduct; their body should be pure, and their speech and mind should be pure.

source: དེ་ལ་ལུས་ཡོངས་སུ་དག་པ་གང་ཞེ་ན།
en: “What is the pure body?

source: གང་རང་གི་ལུས་སྟོང་པ་ཉིད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་སྟོང་པ་ཉིད་དུ་རྗེས་སུ་རྟོགས་པ་དང་། རང་གི་ལུས་དབེན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དབེན་པ་ཉིད་དུ་རྗེས་སུ་རྟོགས་པ་དང་། རང་གི་ལུས་བེམས་པོ་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་བེམས་པོར་རྗེས་སུ་རྟོགས་པ་དང་། རང་གི་ལུས་གཡོ་བ་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་གཡོ་བ་མེད་པར་རྗེས་སུ་རྟོགས་པ་དང་། རང་གི་ལུས་མིག་ཡོར་དང་འདྲ་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་མིག་ཡོར་ལྟ་བུར་རྗེས་སུ་རྟོགས་པ་དང་།
en: It is the realization that because one’s own body is empty, the bodies of all beings are empty; the realization that since one’s own body is void, the bodies of all beings are void; the realization that since one’s own body is inert matter, the bodies of all beings are inert matter; the realization that since one’s own body is inanimate, the bodies of all beings are inanimate; the realization that since one’s own body is like a hallucination, the bodies of all beings are like hallucinations; the realization that since one’s own body is pure, the bodies of all beings are also pure.

source: རང་གི་ལུས་རྣམ་པར་དག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རྣམ་པར་དག་པར་རྗེས་སུ་རྟོགས་པ་སྟེ། འདི་ནི་ལུས་རྣམ་པར་དག་པ་ཞེས་བྱའོ། །
en: This is known as the purity of the body.

source: ཀླུའི་བདག་པོ་གཞན་ཡང་ལུས་ཡོངས་སུ་དག་པ་ནི་ལུས་ཀྱི་ལས་ལ་མངོན་པར་འདུ་མི་བྱེད་པར་རྟོགས་པ་སྟེ། དེ་མངོན་པར་འདུ་བྱེད་པ་ལ་ཡང་མངོན་པར་འདུ་བྱེད་པར་རྟོག་ཅིང་མངོན་པར་འདུ་བྱེད་པ་དང་།
en: “Furthermore, lord of nāgas, bodhisattvas understand that the pure body does not actually perform physical actions.

source: མངོན་པར་འདུ་མི་བྱེད་པ་ཡང་མཉམ་པར་བྱེད། མངོན་པར་འདུ་མི་བྱེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་ཡང་མཉམ་པར་བྱེད་པའོ། །
en: They realize that such performance is formation, that formation is the same as nonformation, and that nonformation is the same as formation.

source: དེ་ལ་ལུས་ཀྱང་ཡོངས་སུ་ཤེས་ཤིང་ལུས་ཀྱི་ཆོས་ཉིད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: This is the true understanding of the body, the full understanding of the body’s true nature.

source: དེ་ལ་ལུས་ཀྱི་ཆོས་ཉིད་གང་ཞེ་ན།
en: What is the body’s true nature?

source: སྔོན་གྱི་མཐའ་ནས་མ་སྐྱེས་པ་ནི་ཆོས་ཉིད་དོ། །ཕྱི་མའི་མཐར་མི་འཕོ་བ་ནི་ཆོས་ཉིད་དོ། །ད་ལྟར་བྱུང་བ་ན་མིག་ཡོར་ལྟ་བུའི་ཆོས་ཉིད་དེ།
en: Throughout the entire extent of the past, its true nature has been unborn; throughout the entire extent of the future, its true nature will not transmigrate; and in the present, its true nature is like a hallucination—this is the true nature of the body.

source: འདི་ནི་ལུས་ཀྱི་ཆོས་ཉིད་ཅེས་བྱའོ། །གཞན་ཡང་ལུས་ཀྱི་ཆོས་ཉིད་ནི་རྒྱུ་དང་རྐྱེན་ཚོགས་པའི་ཆོས་ཉིད་དེ།
en: “Furthermore, the true nature of the body is the true nature of gathered causes and conditions.

source: རྒྱུ་དང་རྐྱེན་གང་ཡིན་པ་དེ་དག་ཀྱང་སེམས་པ་མེད་པའི་ཕྱིར་སྟོང་པ། གཡོ་བ་མེད་པ། ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའོ། །
en: Because those causes and conditions are unintended, it is empty, inanimate, and devoid of any essence.

source: ཀླུའི་བདག་པོ་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ཀྱི་ཆོས་ཉིད་འདི་ལྟ་བུ་འདི་དག་ལ་རྟོག་པ་གང་ཡིན་པ་འདི་ཡང་ལུས་ཡོངས་སུ་དག་པའོ། །
en: Lord of nāgas, these are a bodhisattva’s understandings of the true nature of the body, which is the pure body.

source: གཞན་ཡང་ལུས་ཡོངས་སུ་དག་པ་ནི་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཟག་པ་མེད་ཅིང་ཁམས་གསུམ་དུ་གཏོགས་པ་མ་ཡིན་པ་དེ་བཞིན་དུ། རང་གི་ལུས་ཀྱང་ཟག་པ་མེད་ཅིང་ཁམས་གསུམ་དུ་གཏོགས་པ་མ་ཡིན་པར་རྟོགས་པ་སྟེ།
en: “Furthermore, the purity of the body is the understanding that just as the body of the Thus-Gone One is undefiled and does not belong to the three realms, one’s own body is undefiled and does not belong to the three realms.

source: དེ་ཟག་པ་མེད་པའི་ལུས་ཀྱི་སྲིད་པར་སྐྱེ་བ་སྒྲུབ་ཀྱང་ཟག་པ་མེད་པ་ཡང་དག་པའི་མཐའ་དེ་ཡང་མི་འདོར་རོ། །
en: Even when such an undefiled body is born in the world, it does not lose its undefiled limit of reality.

source: དེ་ཟག་པ་མེད་པའི་ལུས་ཀྱིས་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་གྲུབ་པ་ཡང་སྟོན་ལ། རང་བཞིན་གྱིས་ལུས་ཀྱི་ཆོས་ཉིད་ཀྱི་རང་བཞིན་འདི་ཡང་མི་འདོར་རོ། །
en: Even when the undefiled body takes on and manifests a physical form, this naturally inherent true nature of the body is not lost.

source: དེ་དེ་བཞིན་གཤེགས་པའི་སྐུ་རྣམ་པར་དག་པས་རང་གི་ལུས་རྣམ་པར་དག་པར་རྟོགས་པ་དང་། རང་གི་ལུས་རྣམ་པར་དག་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རྣམ་པར་དག་པར་རྟོགས་པ་འདི་ཡང་ལུས་ཡོངས་སུ་དག་པའོ། །
en: The understanding that since the body of the Thus-Gone One is pure, one’s own body is also pure, and that since one’s own body is pure, the bodies of all beings are also pure—this is the purity of the body.

source: དེ་ལ་ངག་ཡོངས་སུ་དག་པ་གང་ཞེ་ན།
en: “What is the purity of speech?

source: གང་འཕགས་པ་རྣམས་དང་། གང་འཕགས་པ་མ་ཡིན་པ་རྣམས་ཀྱི་ངག་ཐམས་ཅད་ནི་རྣམ་པར་དག་པ་ཡིན་ན།
en: All speech, both the speech of noble ones and the speech of those who are not noble ones, is pure.

source: སྒྲོ་བཏགས་པར་ན་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར། ལེགས་པར་ཐོས་པ་དང་།
en: However, childish ordinary beings become afflicted in all kinds of ways, when they make imputations.

source: ཉེས་པར་ཐོས་པ་རྣམས་ལ་རྗེས་སུ་ཆགས་པ་དང་།
en: They desire that which is experienced as pleasant, and they are averse to that which is experienced as unpleasant.

source: ཁོང་ཁྲོ་བར་འགྱུར་རོ། །ཡང་དག་པར་ངག་ཐམས་ཅད་ནི་འདོད་ཆགས་དང་བྲལ་བ། ཞེ་སྡང་དང་བྲལ་བ། གཏི་མུག་དང་བྲལ་བ་སྟེ།
en: But ultimately all speech is free from desire, free from aversion, and free from delusion.

source: དེ་དག་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། རྨོངས་པའི་ཡི་གེ་རྣམས་མི་འབྱུང་བས་དེའི་ཕྱིར་ངག་ཐམས་ཅད་རྣམ་པར་དག་པ་ཞེས་བྱའོ། །
en: Since even the words desire, aversion, and ignorance are unborn, all speech should be considered pure.

source: ངག་ནི་གསོག་སྟེ། གསོག་ལ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཉོན་མོངས་པར་འགྱུར་བ་མེད་དོ། །
en: Speech is unreal, and that which is unreal is not afflicted by the afflictions of desire, aversion, and delusion.

source: ངག་ནི་གཟུང་བ་མ་ཡིན་པ་སྟེ། མིག་གིས་གཟུང་བར་བྱ་བ་མ་ཡིན་པ་ནས་ཡིད་ཀྱི་བར་གྱིས་གཟུང་བར་བྱ་བ་མ་ཡིན་པའོ། །
en: Speech is beyond grasping—it cannot be grasped by the eye up to cannot be grasped by the mind.

source: ངག་ནི་རླུང་དང་འདྲ་སྟེ། རླུང་གིས་འགྱུར་བའི་ཚོགས་པ་མེད་པར་མི་འབྱུང་ངོ་། །
en: Speech is like the wind—it does not arise without a combination of elements that are then transformed by air.

source: ངག་ནི་བྲག་ཅ་དང་འདྲ་སྟེ།
en: Speech is like an echo.

source: གང་འཕགས་པ་རྣམས་དང་། གང་འཕགས་པ་མ་ཡིན་པ་རྣམས་ཀྱི་ངག་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་དུ་ཡང་མ་ཡིན། གཉིག་མེད་པར་ཡང་མི་དམིགས་ཏེ། རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་གང་དག་གིས་ངག་འབྱུང་བའི་རྣམ་པར་རྟོག་པ་དང་།
en: Speech—both that of the noble ones and those who are not noble ones—is to be found neither inside nor outside, nor anywhere else.
